# CurtainSystemHostInvisible Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainWallFailures..::..CurtainSystemHostInvisible Property
BuiltInFailures..::..CurtainWallFailures Class See Also
---
Element defining the Curtain System is invisible in the current view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CurtainSystemHostInvisible { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CurtainSystemHostInvisible As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CurtainSystemHostInvisible {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurtainWallFailures Class
Autodesk.Revit.DB Namespace